'''
Дана геномная последовательность.
Вывести,
сколько раз в ней встречается нуклеотид цитозин.
Второй способ решения:
'''
genome = input('Введите геномную последовательность:')
print(genome.count('C'))